//______________________________________________________________________________
export function textRule() {
  let text = `اطلاعات عمومی:
اطلاعات حاضر در اینجا درباره ی اطلاعات خصوصی کاربرانی می باشد که از سامانه ی استادبین برای خدمات تدریس خصوصی آنلاین و حضوری استفاده می کنند، و این اطلاعات برای شناسایی کاربران استادبین می باشد. اطلاعات کاربران استادبین شامل شماره موبایل، نام و نام خانوادگی، و سایر اطلاعات می باشد که بصورت عمومی منتشر نخواهند شد. این اطلاعات ممکن است برای استفاده از خدمات تدریس خصوصی موجود در سامانه ی استادبین از کاربران خواسته شود. این اطلاعات فقط برای خدمات درخواستی کاربر مورد استفاده قرار خواهند گرفت.
این اطلاعات کاملاً محرمانه بوده و تنها در اختیار مدرسی که کاربر قصد دریافت خدمات از وی را داشته باشد قرار خواهد گرفت؛ مگر در مواردی که با دستور قضایی در جهت ارتکاب جرمی باشد.

کوکی‌ها:
کاربر باید آگاه باشد که اطلاعات و داده‌ها ممکن است به ‌صورت خودکار و از طریق استفاده از «کوکی‌ها» جمع‌آوری شود. «کوکی‌ها» فایل‌های متنی کوچکی هستند که یک وب ‌سایت می‌تواند از آن‌ ها برای تشخیص کاربران مراجعه‌ کننده مجدد، فراهم کردن امکان دیدبانی رفتار، جمع‌آوری اطلاعات کلی به‌منظور ارتقای وب‌ سایت و مشخص کردن سمت ‌و سوی تبلیغات استفاده کند. کوکی‌ها به سیستم کاربر ملحق نشده و به فایل‌های شما صدمه نمی‌رسانند. اگر کاربر مایل نیست تا اطلاعاتش از طریق استفاده از کوکی‌ها جمع‌آوری شود، در اغلب مرورگرها می‌توان به روشی آسان ویژگی کوکی را قبول و یا رد کرد.

حذف کاربر یا تغییر اطلاعات:
کاربر می تواند در هر بار استفاده از خدمات تدریس خصوصی، اطلاعات خود را ویرایش نماید. همچنین حذف حساب کاربری، از طریق تماس با پشتیبانی امکان پذیر می باشد.

قوانین و مقررات:
هر گونه استفاده از خدمات استادبین به معنی پذیرفتن شرایط مندرج در سایت استادبین می‌باشد. سایت استادبین هیچ توافقی با اساتید خارج از این شرایط ندارد. شرایط و قوانین زیر مربوط به تمام اساتیدی است که به هر شکلی با استادبین همکاری و از خدمات آن استفاده می‌کنند.
اساتید فعال در استادبین با مسئولیت خود برای تدریس به منزل شاگرد مراجعه می‌کنند و استادبین هیچ تعهد یا مسئولیتی در قبال خسارات مستقیم، اتفاقی، تبعی، غیرمستقیم و کیفری، ناشی از ارتباط استاد با شاگرد نخواهد داشت. به عبارتی استادبین صرفا ارتباط بین استاد و شاگرد را هماهنگ می‌کند و به هیچ عنوان تضمینی در مورد نیات و قصد شاگرد به استاد نمی‌تواند ارائه نماید.
با توجه به اینکه هویت و اطلاعات ارائه شده توسط شاگردان به هیچ وجه قابل راستی آزمایی نمی‌باشد، استادبین هیچ مسئولیت یا تعهدی در قبال اطلاعات ارائه شده توسط شاگردان چه از طریق تماس تلفنی و چه از طریق ارسال درخواست معرفی استاد از طریق سایت ندارد.
استادبین مختار است که هر گونه اطلاعات و عکسی که توسط اساتید به سایت ارسال می‌شود یا هر حساب کاربری و اطلاعات دیگری که مربوط به اساتید یا ایجاد شده توسط اساتید باشد را هر زمانی و به هر شکلی که ضروری بداند، اصلاح یا حذف نماید.
تنها دانش‌آموزان خانم، دانشجویان خانم و والدین خانم می‌توانند از خدمات تدریس خصوصی اساتید خانم استادبین استفاده نمایند.
استادبین هیچ قرارداد، تعهدنامه یا سندی را با هیچ شخص حقیقی یا حقوقی در حوزه تدریس خصوصی منعقد نکرده است. اساتید سایت استادبین در هر لحظه قادر به ویرایش پروفایل خود هستند، بنابراین سایت استادبین هیچ‌گونه مسئولیتی در قبال هر نوع اطلاعات درج شده در پروفایل اساتید نخواهد داشت و صرفا مطالب درج شده توسط اساتید را نمایش می‌دهد.
استادبین هیچ قرارداد، تعهدنامه یا سندی با هیچ موسسه یا نهاد آموزشی منعقد نکرده است. لذا درصورتی که اساتید با موسسه‌ یا نهاد آموزشی که خود را طرف قرارداد استادبین می‌داند، همکاری نماید، تمام مسئولیت‌ها با خود استاد مربوطه است و استادبین هیچ تعهد یا مسئولیتی در قبال خسارات مستقیم، اتفاقی، تبعی، غیرمستقیم و کیفری، ناشی از ارتباط استاد با موسسه یا نهاد آموزشی مربوطه نخواهد داشت.
علاوه بر راهکارهای تعبیه شده به منظور اطلاع از تعداد جلسات برگزار شده توسط استاد، معیار و ملاک اعتماد به اظهارات اساتید می‌باشد. چنانچه استادی تخطی نماید و جلسات برگزار شده را به اطلاع استادبین نرسانده یا با تبانی با شاگرد از پرداخت حق معرفی برای برخی از کلاس‌ها خودداری نماید، استادبین این حق را برای خود محفوظ می‌داند که نسبت به هرگونه عملی در خصوص پروفایل، سابقه همکاری و اعتبار مالی اساتید در سایت اقدام نماید.
درصورتی که شاگرد از استاد مربوطه بخواهد که دروس دیگر را نیز به شاگرد تدریس کند، استاد موظف است این کار را با کسب اجازه از استادبین و اطلاع‌رسانی به سایت استادبین انجام دهد. درصورتی که استاد به هر دلیل اطلاع‌رسانی نکند، استادبین این حق را برای خود محفوظ می‌داند که نسبت به هرگونه عملی در خصوص پروفایل، سابقه همکاری و اعتبار مالی اساتید در سایت اقدام نماید.
اکیدا لازم و ضروری است که استاد در خصوص تعهدات خود نسبت به شاگرد پایبند باشد. تماس سریع با شاگرد در زمان معرفی، پاسخ‌گویی به تماس‌های شاگرد پیش از جلسه اول و پس از آن، دریافت وجه به میزان توافق شده و سایر توافقات از جمله تعهدات استاد نسبت به شاگرد می‌باشد.
درصورت مشاهده تخلف یا تلاش برای سوءاستفاده از تضمین درستی رزومه‌ها، حق عدم پذیرش آن درخواست برای استادبین محفوظ است. استادبین می‌تواند در هر زمان به تشخیص خود شرایط تضمین‌ها را تغییر داده یا ارائه آن را متوقف کند. در موارد اختلاف، مدیریت استادبین تصمیم گیرنده نهایی خواهد بود.	`;
  return text;
}
